# 定数
CELL_SIZE = 32
# 顧客の飲食時間
STAY_DURATION = 2.0
# 新規顧客の生成間隔
SPAWN_TIME = 3.0
MAX_CUSTOMERS = 6
MAP_DATA = [
    'BBBBBBBBBBBBBBBBBBB',
    '...................',
    '...................',
    '...................',
    'BBBBBBBBBBBBBBBBD.B',
    'B.................B',
    'B.................B',
    'B.STS.............B',
    'B.................B',
    'B.................B',
    'B.................B',
    'B................WB',
    'B................WB',
    'B................WB',
    'B.................B',
    'BBBBBBBBBBBBBBBBBBB',
]
